; domain
(define (domain emergencias-costs)
    (:requirements :strips :typing :action-costs)
    (:types
        location box bcontent person dron carrier num - object
    )

    (:functions
        (total-cost) - number
        (fly-cost ?l1 ?l2 - location) - number
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        (at-carrier ?c - carrier ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        ;; El dron ahora tiene un único brazo implícito
        (free ?d - dron)
        (carrying ?d - dron ?b - box)
        
        ;; Predicados para el transportador y los números
        (in-carrier ?b - box ?c - carrier)
        (boxes-in-carrier ?c - carrier ?n - num)
        (siguiente ?n1 - num ?n2 - num)
    )

    ;; Mueve solo al dron
    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (and (at-dron ?dron ?from) (free ?dron))
        :effect (and (at-dron ?dron ?to) (not (at-dron ?dron ?from))(increase (total-cost) (fly-cost ?from ?to)))
    )

    ;; Mueve al dron llevándose el transportador consigo
    (:action move-carrier
        :parameters (?from - location ?to - location ?dron - dron ?carrier - carrier)
        :precondition (and (at-dron ?dron ?from) (at-carrier ?carrier ?from) (free ?dron))
        :effect (and (at-dron ?dron ?to) (not (at-dron ?dron ?from)) 
                     (at-carrier ?carrier ?to) (not (at-carrier ?carrier ?from))(increase (total-cost) (fly-cost ?from ?to)))
    )

    ;; Recoge una caja del suelo (requiere tener el brazo libre)
    (:action pick
        :parameters (?box - box ?location - location ?dron - dron)
        :precondition (and (at-dron ?dron ?location) (at-box ?box ?location) (free ?dron))
        :effect (and (not (at-box ?box ?location)) (not (free ?dron)) (carrying ?dron ?box)(increase (total-cost) 1))
    )

    ;; Entrega una caja a una persona
    (:action leave
        :parameters (?box - box ?location - location ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location) (carrying ?dron ?box) (at-person ?person ?location) (box-has ?box ?content))
        :effect (and (at-box ?box ?location) (free ?dron) (not (carrying ?dron ?box)) (person-has ?person ?content) (not (box-has ?box ?content)) (increase (total-cost) 1))
    )

    ;; Mete una caja en el transportador (Suma 1)
    (:action put-in-carrier
        :parameters (?box - box ?location - location ?dron - dron ?carrier - carrier ?n1 - num ?n2 - num)
        :precondition (and (at-dron ?dron ?location) (at-carrier ?carrier ?location) (carrying ?dron ?box) 
                           (boxes-in-carrier ?carrier ?n1) (siguiente ?n1 ?n2))
        :effect (and (not (carrying ?dron ?box)) (free ?dron) (in-carrier ?box ?carrier) 
                     (not (boxes-in-carrier ?carrier ?n1)) (boxes-in-carrier ?carrier ?n2)(increase (total-cost) 1))
    )

    ;; Saca una caja del transportador (Resta 1)
    (:action take-from-carrier
        :parameters (?box - box ?location - location ?dron - dron ?carrier - carrier ?n1 - num ?n2 - num)
        :precondition (and (at-dron ?dron ?location) (at-carrier ?carrier ?location) (free ?dron) (in-carrier ?box ?carrier) 
                           (boxes-in-carrier ?carrier ?n2) (siguiente ?n1 ?n2))
        :effect (and (carrying ?dron ?box) (not (free ?dron)) (not (in-carrier ?box ?carrier)) 
                     (not (boxes-in-carrier ?carrier ?n2)) (boxes-in-carrier ?carrier ?n1)(increase (total-cost) 1))
    )
)

; problem
(define (problem problem_size3)
(:domain emergencias-costs)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 - location
	box1 box2 box3 - box
	comida medicina - bcontent
	person1 person2 person3 - person
	carrier1 - carrier
	n0 n1 n2 n3 n4 - num
)

(:init
	(= (total-cost) 0)
	(= (fly-cost deposito refugio1) 3)
	(= (fly-cost deposito refugio2) 9)
	(= (fly-cost deposito refugio3) 18)
	(= (fly-cost refugio1 deposito) 18)
	(= (fly-cost refugio1 refugio2) 20)
	(= (fly-cost refugio1 refugio3) 14)
	(= (fly-cost refugio2 deposito) 14)
	(= (fly-cost refugio2 refugio1) 20)
	(= (fly-cost refugio2 refugio3) 10)
	(= (fly-cost refugio3 deposito) 18)
	(= (fly-cost refugio3 refugio1) 16)
	(= (fly-cost refugio3 refugio2) 6)
	(siguiente n0 n1)
	(siguiente n1 n2)
	(siguiente n2 n3)
	(siguiente n3 n4)
	(at-dron dron1 deposito)
	(free dron1)
	(at-carrier carrier1 deposito)
	(boxes-in-carrier carrier1 n0)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-person person1 refugio2)
	(at-person person2 refugio3)
	(at-person person3 refugio3)
)

(:goal (and
	(person-has person1 comida)
	(person-has person2 comida)
	(person-has person3 comida)
))
(:metric minimize (total-cost))
)

; plan
1. (pick box1 deposito dron1)
   deleted: (at-box box1 deposito) (free dron1)
   added: (carrying dron1 box1)
   goals met: 0 of 3
2. (put-in-carrier box1 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box1) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box1 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 0 of 3
3. (move-carrier deposito refugio2 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio2) (at-carrier carrier1 refugio2)
   goals met: 0 of 3
4. (take-from-carrier box1 refugio2 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box1 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box1) (boxes-in-carrier carrier1 n0)
   goals met: 0 of 3
5. (leave box1 refugio2 dron1 person1 comida)
   deleted: (carrying dron1 box1) (box-has box1 comida)
   added: (at-box box1 refugio2) (free dron1) (person-has person1 comida)
   goals met: 1 of 3
6. (move-carrier refugio2 deposito dron1 carrier1)
   deleted: (at-dron dron1 refugio2) (at-carrier carrier1 refugio2)
   added: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   goals met: 1 of 3
7. (pick box2 deposito dron1)
   deleted: (at-box box2 deposito) (free dron1)
   added: (carrying dron1 box2)
   goals met: 1 of 3
8. (put-in-carrier box2 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box2) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box2 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 1 of 3
9. (move-carrier deposito refugio3 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio3) (at-carrier carrier1 refugio3)
   goals met: 1 of 3
10. (take-from-carrier box2 refugio3 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box2 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box2) (boxes-in-carrier carrier1 n0)
   goals met: 1 of 3
11. (leave box2 refugio3 dron1 person2 comida)
   deleted: (carrying dron1 box2) (box-has box2 comida)
   added: (at-box box2 refugio3) (free dron1) (person-has person2 comida)
   goals met: 2 of 3
12. (move-carrier refugio3 deposito dron1 carrier1)
   deleted: (at-dron dron1 refugio3) (at-carrier carrier1 refugio3)
   added: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   goals met: 2 of 3
13. (pick box3 deposito dron1)
   deleted: (at-box box3 deposito) (free dron1)
   added: (carrying dron1 box3)
   goals met: 2 of 3
14. (put-in-carrier box3 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box3) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box3 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 2 of 3
15. (move-carrier deposito refugio3 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio3) (at-carrier carrier1 refugio3)
   goals met: 2 of 3
16. (take-from-carrier box3 refugio3 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box3 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box3) (boxes-in-carrier carrier1 n0)
   goals met: 2 of 3
17. (leave box3 refugio3 dron1 person3 comida)
   deleted: (carrying dron1 box3) (box-has box3 comida)
   added: (at-box box3 refugio3) (free dron1) (person-has person3 comida)
   goals met: 3 of 3
